# add additional repositories which are not in the official formale
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "kylef/formulae"

brew "jq"
brew "gh"
brew "git"
brew "grc"
brew "asdf"
brew "grep"
brew "tree"
brew "wget"
brew "tfenv"
brew "pyenv"
brew "rbenv"
brew "vapor"
brew "awscli"
brew "fastlane"
brew "cfn-lint"
brew "readline"
brew "swiftlint"
brew "coreutils"
brew "colordiff"
brew "pre-commit"
brew "ruby-build"
brew "swiftformat"
brew "sublime-text"
brew "rbenv-gemset"
brew "postgresql@14"
brew "rbenv-bundler"
brew "kylef/formulae/swiftenv"

# install  macOS UI apps using Homebrew
# cask "visual-studio-code"