# add additional repositories which are not in the official formale
# tap "homebrew/bundle"
# tap "homebrew/core"
# tap "homebrew/cask"
tap "kylef/formulae"
tap "hashicorp/tap"
tap "git-chglog/git-chglog"


## install  macOS UI apps using Homebrew
## How to check if these are installed already?


# Set arguments passed to all `brew install --cask` commands for `cask "..."`
# In this example, pass `--appdir=~/Applications` and `--require_sha`
# cask_args appdir: "~/Applications", require_sha: true

cask "gimp"
# cask "mactex"
cask "docker"
# cask "mark-text"
# cask "sublime-text"
# cask "visual-studio-code"
cask "postgres-unofficial"
cask "session-manager-plugin"


## install command line software
brew "n" # preferred node version manager; nvm does not support Homebrew
brew "jq"
brew "gh"
brew "go"
brew "yq" # parse yaml files via shell; useful in Makefiles
brew "act"
brew "git"
brew "grc"
brew "tig" # command-line GUI for git
brew "vim"
brew "asdf"
brew "grep"
brew "hurl"
brew "tree"
brew "make"
brew "mint" # installed for SwiftPackageManager work
brew "rust" # stable diffusion requirement
brew "wget"
brew "cmake" # stable diffusion requirement
brew "delve"
brew "tfenv"
brew "trivy" # scan github repo's for vulnerabilities
brew "pyenv"
brew "vapor"
brew "chruby"
brew "mysql"
brew "awscli"
brew "ansible"
brew "openssl"
brew "protobuf" # stable diffusion requirement
brew "cfn-lint"
brew "readline"
brew "swiftlint"
brew "coreutils"
brew "colordiff"
brew "git-chglog" # changelog denerator
brew "pre-commit"
brew "ruby-build"
brew "swiftformat"
brew "ruby-install"
brew "postgresql@14"
brew "terraform-docs"
brew "git-filter-repo"
brew "bash-completion"
brew "hashicorp/tap/packer"
brew "kylef/formulae/swiftenv"
brew "xcodesorg/made/xcodes"