# add additional repositories which are not in the official formale
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "kylef/formulae"
tap "hashicorp/tap"


## install  macOS UI apps using Homebrew
## How to check if these are installed already?
# cask "sublime-text"
cask "session-manager-plugin"


## install command line software
brew "jq"
brew "gh"
brew "go"
brew "yq" # parse yaml files via shell; useful in Makefiles
brew "git"
brew "grc"
brew "asdf"
brew "grep"
brew "tree"
brew "make"
brew "wget"
brew "tfenv"
brew "pyenv"
brew "vapor"
brew "chruby"
brew "mysql"
brew "awscli"
brew "ansible"
brew "openssl"
brew "cfn-lint"
brew "readline"
brew "swiftlint"
brew "coreutils"
brew "colordiff"
brew "pre-commit"
brew "ruby-build"
brew "swiftformat"
brew "ruby-install"
brew "postgresql@14"
brew "hashicorp/tap/packer"
brew "kylef/formulae/swiftenv"
